Opentrons/opentrons-modules/stm32-modules/vacuum-module/firmware/vent/vent_hardware.c
#include <stdint.h>

#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_conf.h"
#include "stm32g4xx_hal_gpio.h"
#include "stm32g4xx_hal_def.h"

#include "firmware/vent_hardware.h"
#include "main.h"


DAC_HandleTypeDef hdac1;

static uint8_t clamp(uint8_t val, uint8_t min, uint8_t max) {
    if (val < min) {
        return min;
    }
    if (val > max) {
        return max;
    }
    return val;
}

/**
 * @brief Initialize the Vent GPIO pins
 */
void vent_hardware_gpio_init(void) {
    /* GPIO Ports Clock Enable */
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /*Configure Output GPIO pins : PA3, PA4, and PA5 */
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Pull = GPIO_PULLUP;

    GPIO_InitStruct.Pin = nSLEEP_DRV_MCU_GPIO_Pin;
    HAL_GPIO_Init(nSLEEP_DRV_MCU_GPIO_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = VENT_IN_GPIO_Pin;
    HAL_GPIO_Init(VENT_IN_GPIO_Port, &GPIO_InitStruct);

    /*Configure Input GPIO pins : PA6 */
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Pin = VENT_FAULT_GPIO_Pin;
    HAL_GPIO_Init(VENT_FAULT_GPIO_Port, &GPIO_InitStruct);
}

void hw_set_vent_state(VentState state) {
    bool open = (bool)state;
    HAL_GPIO_WritePin(VENT_IN_GPIO_Port, VENT_IN_GPIO_Pin, open ? GPIO_PIN_SET : GPIO_PIN_RESET);
    // Puts stepper into low power mode
    HAL_GPIO_WritePin(nSLEEP_DRV_MCU_GPIO_Port, nSLEEP_DRV_MCU_GPIO_Pin, open ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

VentState hw_get_vent_state() {
    bool open = HAL_GPIO_ReadPin(VENT_IN_GPIO_Port, VENT_IN_GPIO_Pin) == GPIO_PIN_SET;
    return (VentState)open;
}

bool hw_vent_fault_detected() {
    return HAL_GPIO_ReadPin(VENT_FAULT_GPIO_Port, VENT_FAULT_GPIO_Pin);
}

void hw_set_vent_voltage(double volt) {
    uint32_t val = (uint32_t)(clamp(volt, 0, REF_VOLTAGE)*DAC_FULLRANGE/REF_VOLTAGE);
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, val);
    if (val > 0) {
        HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
    } else {
        HAL_DAC_Stop(&hdac1, DAC_CHANNEL_1);
    }
}

void vent_hardware_init(void) {
    vent_hardware_gpio_init();
    // close the vent
    hw_set_vent_voltage(VENT_RUN_VOLT);
    hw_set_vent_state(CLOSED);
}
